
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Оплата.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оплата.Дата,
	|	Оплата.Клиент,
	|	Оплата.Номер,
	|	Оплата.Сотрудник,
	|	Оплата.Сумма,
	|	Оплата.СуммаНаличными
	|ИЗ
	|	Документ.Оплата КАК Оплата
	|ГДЕ
	|	Оплата.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок"); 
	ОбластьЗаголовок.Параметры.НаименованиеОрганизацииПолное = Константы.НаименованиеОрганизацииПолное.Получить(); 
	ОбластьЗаголовок.Параметры.ТелефонОрганизации = Константы.Телефон.Получить();
	ОбластьЗаголовок.Параметры.АдресОрганизации = Константы.АдресОрганизации.Получить();
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	Расчет = Макет.ПолучитьОбласть("Расчет"); 
	Итог = Макет.ПолучитьОбласть("Итог"); 
	Подвал = Макет.ПолучитьОбласть("Подвал"); 	
		ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь; 
	Итого = 0;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 	
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);  
		ТабДок.Вывести(ОбластьЗаголовок); 		 
        Шапка.Параметры.Заполнить(Выборка); 
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		Расчет.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Расчет);
		Итого = Расчет.Параметры.СуммаНаличными - Расчет.Параметры.Сумма;
		ВставлятьРазделительСтраниц = Истина;  	
	КонецЦикла;                      
	Итог.Параметры.Сдача = Итого;
	ТабДок.Вывести(Итог);
	Подвал.Параметры.Заполнить(Выборка);
	ТабДок.Вывести(Подвал);

	
	//}}
КонецПроцедуры
