
&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	Объект.Сумма = ПолучитьСумму(Объект.НомерДоговора);
	Объект.Клиент = ПолучитьКлиента(Объект.НомерДоговора);
	Объект.Сотрудник = ПолучитьСотрудника(Объект.НомерДоговора);
	КонецПроцедуры

&НаСервере
Функция
	ПолучитьСумму(сумма)
	Возврат сумма.СуммаДоговора;
конецфункции

&НаСервере
Функция
	ПолучитьКлиента(клиент)
Возврат клиент.Клиент;
конецфункции    

&НаСервере
Функция
	ПолучитьСотрудника(сотрудник)
Возврат сотрудник.Сотрудник;
конецфункции
