
&НаКлиенте
Процедура СодержаниеДоговораПутевкаПриИзменении(Элемент)  
	СтрокаТЧ = Элементы.СодержаниеДоговора.ТекущиеДанные;
	ДатаОтправления = ПолучитьДату(СтрокаТЧ.Путевка); 
	СтрокаТЧ.ЦенаПутевки = ПолучитьСтоимость(СтрокаТЧ.Путевка);
	Если Месяц(ДатаОтправления) = 6 или Месяц(ДатаОтправления) = 8 Или Месяц(ДатаОтправления) = 7 тогда
        СтрокаТЧ.ЦенаПутевки = СтрокаТЧ.ЦенаПутевки * 1.2;   
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьДату (дата)
	ДатаОтправления = дата.ДатаОтправления;
	Возврат ДатаОтправления;
КонецФункции    

&НаСервере
Функция ПолучитьСтоимость (цена)
	СтоимостьТура = цена.Тур.Стоимость;
	Возврат СтоимостьТура;
КонецФункции

&НаКлиенте
Процедура СодержаниеДоговораПриИзменении(Элемент) 
	СтрокаТЧ = Элементы.СодержаниеДоговора.ТекущиеДанные;
	Объект.СуммаДоговора = 0;
	для каждого СтрокаТЧ из Объект.СодержаниеДоговора Цикл
		Объект.СуммаДоговора = Объект.СуммаДоговора + СтрокаТЧ.ЦенаПутевки;
	КонецЦикла; 
КонецПроцедуры   

&НаСервере
Функция СодержаниеДоговораПутевка(Путевка)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПутевкиОстатки.Путевка КАК Путевка,
		|	ОстаткиПутевкиОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиПутевки.Остатки КАК ОстаткиПутевкиОстатки
		|ГДЕ
		|	ОстаткиПутевкиОстатки.КоличествоОстаток < &КоличествоОстаток";
	
	Запрос.УстановитьПараметр("КоличествоОстаток", 0);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи 
		Сообщить ("")
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции


	


