
&НаКлиенте
Процедура Показать(Команда)
	Элементы.Показать.Видимость = Ложь;
    Элементы.Скрыть.Видимость = Истина;
    Элементы.Пароль.РежимПароля = "Нет";
КонецПроцедуры

&НаКлиенте
Процедура Скрыть(Команда)
	Элементы.Показать.Видимость = Истина;
    Элементы.Скрыть.Видимость = Ложь;
    Элементы.Пароль.РежимПароля = "Да";
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	ДанныйСотрудник = Справочники.Сотрудник.НайтиПоНаименованию(ФИО);
	ИзменитьСотрудник = ДанныйСотрудник.ПолучитьОбъект();
	ИзменитьСотрудник.НомерТелефона=Телефон;
	ИзменитьСотрудник.Email=Email;
	ИзменитьСотрудник.Пароль=Пароль; 
	ИзменитьСотрудник.Записать();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	//ФИО = ПользователиИнформационнойБазы.ТекущийПользователь(); 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!      
	Логин = Пользователь.Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудник.Наименование КАК Наименование,
		|	Сотрудник.Должность КАК Должность,
		|	Сотрудник.НомерТелефона КАК НомерТелефона,
		|	Сотрудник.Пароль КАК Пароль,
		|	Сотрудник.Email КАК Email
		|ИЗ
		|	Справочник.Сотрудник КАК Сотрудник
		|ГДЕ
		|	Сотрудник.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Логин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи  
		ФИО = ВыборкаДетальныеЗаписи.Наименование;
		Должность = ВыборкаДетальныеЗаписи.Должность;
		Телефон = ВыборкаДетальныеЗаписи.НомерТелефона;
		EMail = ВыборкаДетальныеЗаписи.EMail;
		Пароль = ВыборкаДетальныеЗаписи.Пароль;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА




КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
