
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	Вывод();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	Вывод();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	Вывод();
КонецПроцедуры

Функция Вывод() 
	Если не ПустаяСтрока(Объект.Фамилия) и не ПустаяСтрока(Объект.Имя) тогда
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
		Конецесли;	
КонецФункции

&НаКлиенте
Процедура Зарегистроваться(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Файл = Новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда 
		//Для передачи содержимого файла в серверную процедуру,
		//в которой возможна работа с хранилищем и запись объекта,
		//необходимо файл преобразовать в двоичные данные
		ДД = Новый ДвоичныеДанные(ПутьКФайлу);
		ЗагрузитьНаСервере(ДД);
		
		//Так как объект при загрузке будет записан, 
		//то снимаем признак модифицированности (отображается звёздочкой в заголовке формы)
		//Объект записывать не обязательно, 
		//но тогда необходимо обновлять отображение логотипа после записи объекта
		ЭтаФорма.Модифицированность = Ложь;
		ОбновитьЛоготип();
	Иначе
		Сообщить("Выберите файл картинки");
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьНаСервере(ДД)
	Хранилище = Новый ХранилищеЗначения(ДД);
	//Специфика работы с реквизитом формы объектном типа, заключается в том,
	//что нельзя работать полноценно с этим объектом для изменения и записи напрямую.
	//Для этого необходимо преобразовывать реквизит в значение, а затем обратно
	Об = РеквизитФормыВЗначение("Объект");
	Об.Логотип = Хранилище;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");  		
КонецПроцедуры

&НаСервере
Процедура ОбновитьЛоготип()
	ЛоготипКартинка = ПоместитьВоВременноеХранилище(Объект.Ссылка.Логотип.Получить(), УникальныйИдентификатор);КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЛоготип();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	Парам = Новый Структура("КонтактноеЛицо, Телефон", Объект.КонтактноеЛицо, Объект.Телефон);
	ОткрытьФорму("РегистрСведений.Сообщения.ФормаЗаписи", Парам);
КонецПроцедуры


&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите картинку для загрузки";
	Диалог.Фильтр = "Рисунок JPG(*.jpg)|*.jpg|Рисунок PNG(*.png)|*.png"; 
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

