
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиПутевки Расход
	Движения.ОстаткиПутевки.Записывать = Истина;
	Для Каждого ТекСтрокаСодержаниеДоговора Из СодержаниеДоговора Цикл
		Движение = Движения.ОстаткиПутевки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Путевка = ТекСтрокаСодержаниеДоговора.Путевка;
		Движение.Количество = 1;   
		
	КонецЦикла;  
	Движения.Записать();

	// регистр СуммаДоговоров Приход
	Движения.СуммаДоговоров.Записывать = Истина;
	Движение = Движения.СуммаДоговоров.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Клиент = Клиент;
	Движение.Дата = Дата;
	Движение.Сумма = СуммаДоговора; 
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПутевкиОстатки.Путевка КАК Путевка,
		|	ОстаткиПутевкиОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиПутевки.Остатки КАК ОстаткиПутевкиОстатки
		|ГДЕ
		|	ОстаткиПутевкиОстатки.КоличествоОстаток < &КоличествоОстаток";
	
	Запрос.УстановитьПараметр("КоличествоОстаток", 0);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи 
		Сообщить ("Путевок нет");
		Отказ = Истина;
	КонецЦикла;
	
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры
